{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing updated text‑color–related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling focus of each frontend component.",
  "frontend/index.css": "Global Tailwind base and CSS variable definitions for light/dark theme color tokens and layout defaults.",
  "frontend/index.html": "Basic HTML shell loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main app component composing all site sections and the mobile CTA bar.",
  "frontend/src/components/CallToActionBar.tsx": "Mobile-only sticky call bar that appears after scrolling and links to phone contact.",
  "frontend/src/components/ContactSection.tsx": "Contact section featuring phone CTA, service hours, area details, and styled info cards.",
  "frontend/src/components/Footer.tsx": "Footer with company info, quick contact links, service list, and branding elements.",
  "frontend/src/components/HeaderNav.tsx": "Responsive header with scroll‑reactive styling, navigation links, and mobile menu.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, headline, CTA buttons, and quick info cards for towing services.",
  "frontend/src/components/PhotosSection.tsx": "Displays a gallery of towing service photos using a responsive grid of image cards.",
  "frontend/src/components/ServiceAreaSection.tsx": "Shows service coverage details for Nellore with descriptive content and a list of covered areas.",
  "frontend/src/components/ServicesSection.tsx": "Lists available towing services with icons and descriptions plus a call‑to‑action section.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity and refreshes queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, global styles, and shared layout utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color tokens, custom radii, shadows, fonts, and keyframes for UI styling.",
  "project_state.json": "Stores project metadata, feature lists, and pending requests for the PMK Towing Service project."
}