{
  "backend/main.mo": "Minimal Motoko actor with no methods defined.",
  "feature_evidence.json": "Structured report mapping implemented features to source files, components, and test IDs for the towing service website.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of all frontend components and styling files.",
  "frontend/index.css": "Tailwind base/style setup defining custom OKLCH color variables and dark mode values for the theme.",
  "frontend/index.html": "HTML entry point loading the React app and mounting it to the root element.",
  "frontend/src/App.tsx": "Main React component assembling navigation, all content sections, footer, and the mobile CTA bar.",
  "frontend/src/components/CallToActionBar.tsx": "Sticky mobile-only call bar that appears after scrolling and links to the emergency phone number.",
  "frontend/src/components/ContactSection.tsx": "Contact section with call actions, service hours, service area, emergency info, and reasons to choose the towing service.",
  "frontend/src/components/Footer.tsx": "Footer displaying company info, quick contact details, service list, and dynamic year attribution.",
  "frontend/src/components/HeaderNav.tsx": "Fixed header with logo, scroll-based styling, desktop/mobile navigation, and a click-to-call button.",
  "frontend/src/components/HeroSection.tsx": "Renders the homepage hero section with background image, service highlights, and call-to-action buttons.",
  "frontend/src/components/ServiceAreaSection.tsx": "Displays service coverage information for Nellore with listed areas and contact link.",
  "frontend/src/components/ServicesSection.tsx": "Shows a grid of towing services with icons and descriptions plus a call-for-help prompt.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and auth client setup.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom theme variables for the app’s color scheme and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for the frontend.",
  "project_state.json": "Defines project metadata and required features for building the PMK TOWING SERVICE website, including visual and functional requirements."
}