{
  "kind": "build_request",
  "title": "Update UI text colors across the site",
  "projectName": "PMK Towing Service",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the site-wide text color palette so all body text, headings, muted/secondary text, and link text use the new colors consistently across all sections (Header, Hero, Services, Service Area, Photos, Contact, Footer, and the mobile Call To Action bar). Prefer adjusting the theme tokens (CSS variables used by Tailwind) so most components update automatically, and only change component-level classes where text colors are hard-coded.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Please change text colours"
        ]
      },
      "acceptanceCriteria": [
        "Changing the theme text colors is done primarily via CSS variables in frontend/src/index.css (e.g., foreground, muted-foreground, primary-foreground, secondary-foreground, etc.), so existing Tailwind semantic classes (text-foreground, text-muted-foreground, text-primary, text-secondary-foreground/XX) reflect the updated colors site-wide.",
        "All text remains clearly readable against its background in the main page sections (including hero overlay text, cards, footer, and sticky mobile call bar).",
        "No user-facing text content, phone numbers, or links are changed; this is a visual-only color update.",
        "Dark mode tokens (if present/used) remain coherent and readable after the update."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose them only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the existing single-page sections and all existing content/links intact (e.g., tel:+917842969695 and section anchors)."
  ],
  "nonGoals": [
    "Redesigning layout, spacing, typography scale, or adding/removing sections.",
    "Changing or regenerating AI image assets (logo/hero/photos) as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}