{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PMK Towing Service — Site-wide text color palette update",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update theme text color tokens and align any hard-coded text/link classes so all sections use the new palette consistently (including mobile CTA bar) while keeping content unchanged.",
      "acceptanceCriteria": [
        "Changing the theme text colors is done primarily via CSS variables in frontend/src/index.css (e.g., foreground, muted-foreground, primary-foreground, secondary-foreground, etc.), so existing Tailwind semantic classes (text-foreground, text-muted-foreground, text-primary, text-secondary-foreground/XX) reflect the updated colors site-wide.",
        "All text remains clearly readable against its background in the main page sections (including hero overlay text, cards, footer, and sticky mobile call bar).",
        "No user-facing text content, phone numbers, or links are changed; this is a visual-only color update.",
        "Dark mode tokens (if present/used) remain coherent and readable after the update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the light and dark theme CSS variables (e.g., --foreground, --muted-foreground, --primary-foreground, --secondary-foreground, and related semantic tokens) to the new text color palette so Tailwind semantic text classes update site-wide automatically; ensure contrast remains readable on all current section backgrounds and overlays."
        },
        {
          "path": "frontend/src/components/HeaderNav.tsx",
          "operation": "modify",
          "description": "Audit header navigation text/link color classes for any hard-coded or non-semantic text colors and adjust to semantic Tailwind classes (e.g., text-foreground, text-muted-foreground, text-primary) as needed so the new palette applies consistently; do not change any labels, phone number, or links."
        },
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Audit hero headline, paragraph, and CTA link/button text color classes (including gradient/overlay readability) and adjust only where colors are hard-coded so text remains readable and consistent with the updated theme tokens; do not change any displayed copy or hrefs."
        },
        {
          "path": "frontend/src/components/ServicesSection.tsx",
          "operation": "modify",
          "description": "Audit services section headings, descriptions, and the phone link text colors; replace any hard-coded text colors with semantic Tailwind classes where needed to align with updated theme tokens while keeping all content unchanged."
        },
        {
          "path": "frontend/src/components/ServiceAreaSection.tsx",
          "operation": "modify",
          "description": "Audit service area section text (titles, list items, and phone link) for hard-coded text/link colors and adjust to semantic Tailwind classes as needed for consistent application of the new palette."
        },
        {
          "path": "frontend/src/components/PhotosSection.tsx",
          "operation": "modify",
          "description": "Audit photos section heading/subtitle text classes for any hard-coded colors and align them with semantic Tailwind classes so they reflect the new theme tokens consistently."
        },
        {
          "path": "frontend/src/components/ContactSection.tsx",
          "operation": "modify",
          "description": "Audit contact section headings, supporting text, and phone number/link styling for hard-coded text colors; update to semantic Tailwind classes where needed to keep contrast/readability consistent with the new palette without changing any text or links."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Audit footer text (including secondary-foreground opacity variants and link colors) to ensure they remain readable and consistent after token updates; adjust only hard-coded text color classes to semantic equivalents where necessary while keeping all content/links intact."
        },
        {
          "path": "frontend/src/components/CallToActionBar.tsx",
          "operation": "modify",
          "description": "Audit the mobile sticky call-to-action bar text/button color classes to ensure readability and consistent use of updated semantic tokens (primary/secondary foregrounds) after the palette change; do not alter phone number or CTA text."
        }
      ]
    }
  ]
}